[{"sentiment": "negative", "complaints": [4], "review": "The whole Alton Towers experience was tarnished for me by the overwhelming feeling that the site was trying to fleece us at every turn."}, {"sentiment": "negative", "complaints": [0, 4], "review": "Queue world. You go to stand in a queue. Atrocious value for money. £100 to get in for, about, 10minutes (generous) of 'thrill' (or abstract fear with their safety record)."}, {"sentiment": "positive", "complaints": [], "review": "We booked into Splash landings hotel for a 2 night stay, and what can I say, but absolutely fantastic themed hotel, awesome staff, clean and tide. Food and breakfast was outstanding. There was a massive internal water park and crazy golf on site. The free mono rail is 5 minutes ride to the park gates. Alton towers park is amazing, you will need a minimum of two days to appreciate all the rides. All in all I'd score it 9/10 for our visit."}, {"sentiment": "positive", "complaints": [], "review": "Nice"}, {"sentiment": "positive", "complaints": [0], "review": "It's been a great day for us as a family, got on all the rides but was a few with long queues"}, {"sentiment": "positive", "complaints": [], "review": "really enjoyed our day but we think access pass could do with better signage and maybe more boards with the park map on, given its not always easy to get mobile connection on the site. We thought the staff were really professional and helpful."}, {"sentiment": "negative", "complaints": [0], "review": "Don't know how accurate the wait times on the rides are meant to be. Split up to go on two rides, nemesis and funk n fly. Funk and fly showing 25 minutes and nemesis 40 minutes. The group that went on nemesis were on off and on another ride before we'd even got on Funk n fly."}, {"sentiment": "negative", "complaints": [0, 3], "review": "every ride we qued up for broke down when on it or as we were next on, nemesis,Rita thirteen,wicker man, sky ride, flavinos, gangster granny. had to re que for wicker man and gangster granny. lost so much time it ruined day."}, {"sentiment": "positive", "complaints": [], "review": "i love alton towers especially because are the rides are epic. thanks really enjoyed my visit. nothing to complain about"}, {"sentiment": "positive", "complaints": [], "review": "I heart ALTON TOWERS! WHERE WONDERS NEVER CEASE! #MERLIN"}, {"sentiment": "positive", "complaints": [], "review": "absolutely awesome day out definitely will be going again"}, {"sentiment": "negative", "complaints": [0], "review": "Queue times are soooo long and really takes the fun out of the day"}, {"sentiment": "positive", "complaints": [], "review": "Me and my best friend had the best day ever loved every bit of it, the app was very useful and helped a lot to find the rides. 💗"}, {"sentiment": "positive", "complaints": [], "review": "First time at Alton. not disappointed, rides are amazing. No queues. \nCan understand why it gets visited by youngsters. We are older and wanted to see the gardens, which were good but as the signs say, lots of steps!!! \nWill be visiting again."}, {"sentiment": "positive", "complaints": [], "review": "Had a fantastic time great rides loved the wicker man"}, {"sentiment": "positive", "complaints": [], "review": "Jasmine on Galactica was fab with our son who was measured and made to feel great when reaching the 1.4mark! Thanks for a fabulous day as always!!"}, {"sentiment": "negative", "complaints": [], "review": "Octonauts ride is so scary I passed out and I’m 38! It should be on the thrill rides section next to smiler and oblivion!! Super scary my wife cried 18 different times on it"}, {"sentiment": "positive", "complaints": [1], "review": "The staff are always really helpful and friendly. Only slight problem was when trying to find our lodge…after searching for half an hour I went back to reception and said that it seems like the map out front is upside down…to which they replied that it is upside down.  I really liked the lodge. They look amazing, they’re clean and comfortable. Shame there isn’t a room with some music on for the kids in the evening ‘in the restaurant building- but was told we could go over to the hotels for entertainment.\nThe food in the wider park isn’t to my taste (it’s all chips/cheese and sausages). Ended up getting a jacket potatoe with beans (from cebeebiesland cafe) both days. It was quite nice but if we’d have stayed more than two days it wouldn’t have been.  \nThe breakfast in the crooked spoon restaurant was fine. They don’t have vegi sausages which is usually found in buffets but I didn’t miss my lonely sausage, as the hash browns and eggs were nice and they have nice bread. \nEven though I’ve moaned, they’re only minor things- I can’t fault the trip really"}, {"sentiment": "negative", "complaints": [3], "review": "When you want to go to your favourite ride it will be closed don’t come hear food machines doesn’t work thore park recommend."}, {"sentiment": "positive", "complaints": [], "review": "We had a blast all the rides where amazing thank you"}, {"sentiment": "neutral", "complaints": [3], "review": "It was really good fun but I wish smiler was open or just give us a reason for why it’s not open."}, {"sentiment": "positive", "complaints": [3], "review": "The ride has a problem and all of the staff were very nice and let us no what was happening thank you Alton towers staff"}, {"sentiment": "positive", "complaints": [], "review": "Staff we’re really helpful and kind they took my visit to another level the ques were quite quick"}, {"sentiment": "positive", "complaints": [3], "review": "It was so good the track fell down and started to go backwards the coaster started to have a mind of its own"}, {"sentiment": "positive", "complaints": [0], "review": "it’s great i actually love alton towers. Rides never disappoint. Just the que’s are massive and mostly not worth the wait"}, {"sentiment": "positive", "complaints": [0, 1, 3, 4], "review": "Great family day out. Excellent rides with something for everyone. However, several delays on rides due to operational/maintenance issues. Surely these should have be sorted out during the winter closure. Food and drinks also extortionately expensive and not of particularly high quality. Some areas of the park a bit scruffy given the high gate entrance price. Overall though a very enjoyable day"}, {"sentiment": "negative", "complaints": [0, 4], "review": "Fantastic day out apart from the queues, it’s unfair that anyone is able to queue jump just because they can afford to pay extra."}, {"sentiment": "positive", "complaints": [], "review": "Just amazing it was just too good! 😎"}, {"sentiment": "positive", "complaints": [], "review": "Stayed in Alton Towers Hotel with 2 day pass and Waterpark. Hotel guests could be in Waterpark all day without timed entry, best Waterpark ever for us. Could sit when I wanted, could go in shade when I wanted, hot pools as well as cold pools, water fountains are insane. Quick and early entrance for hotel guests into theme park, fantastic for getting to first ride front of queue, app for knowing queuing times and getting around the site, fantastic, food was fabulous and reasonably priced for a theme park. Planning next years trip already. 😀"}, {"sentiment": "positive", "complaints": [], "review": "No Theme Park Like Alton Towers can Beat it I went On 4th June 2022 and LOVED It 😍 Seriously I can’t Take Myself Onto Oblivion My Dad Hated Oblivion My Favourite Is Wicker Man and Runaway MineTrain"}, {"sentiment": "negative", "complaints": [4], "review": "As title states, rides are brilliant but food abs drink are criminally overpriced!."}, {"sentiment": "positive", "complaints": [0], "review": "Thoroughly enjoyed our day.  The staff are all lovely and helpful.  Waiting times, as always, are\nFrustrating but no idea what you do about that.\n Plenty of shade in this hot weather and lots of opportunities to get water."}, {"sentiment": "negative", "complaints": [0, 3], "review": "It was good I had fast passes but still had to wait a long time and like in Nemesis thy were only letting 1 on at a time and it was rubbish they just send ones off by themselves."}, {"sentiment": "positive", "complaints": [], "review": "It was amazing"}, {"sentiment": "positive", "complaints": [0], "review": "Hello I loved it a lot it was really fun and everything the drop on oblivion was amazing but I think the que times were ridiculous I was there till 10-3 and could only go on oblivion and the runaway mine train"}, {"sentiment": "positive", "complaints": [], "review": "The staff was amazing and respectful and the rides were amazing as well definitely deserves 5 stars"}, {"sentiment": "negative", "complaints": [0, 1, 2, 3], "review": "Don’t look at the wait times!! They are not accurate. Went to the Smiler, wait time was 90 minutes, okay awesome! We ended up getting on the ride THREE HOURS LATER. otherwise great experience but at least be honest with your wait times… otherwise compensate the guests"}, {"sentiment": "positive", "complaints": [], "review": "Just had our first trip to Alton towers the map was fantastic for navigation including routes to rides and accurate queue times - bought our parking tickets through it too"}, {"sentiment": "positive", "complaints": [4], "review": "We have just spent the last two days at the park. Amazing fun. Friendly staff! Food is a bit pricey making it an expensive day out but otherwise great!"}]